app/controllers/platform_admin/dashboard_controller.rb

SELECT "vendors".* FROM "vendors"
---
  def show
    @vendors = Vendor.all