app/controllers/platform_admin/vendors_controller.rb

  def update
    if params[:pending]
      vendor = Vendor.find(params[:id])
      vendor.update(status: params[:pending])
      vendor.users.last.roles.create(name: "vendor_admin")
      flash[:success] = "#{vendor.name} has been approved" if params[:pending] == "active"
    else
      vendor = Vendor.find(params[:id])
      vendor.update(vendor_params)
      flash[:success] = "#{Vendor.find(vendor.id).name} has been updated."
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "vendors" SET "status" = $1, "updated_at" = $2 WHERE "vendors"."id" = $3  [["status", 1], ["updated_at", "2016-05-15 06:38:58.541045"], ["id", 1]]
SELECT  "users".* FROM "users" INNER JOIN "user_roles" ON "users"."id" = "user_roles"."user_id" WHERE "user_roles"."vendor_id" = $1  ORDER BY "users"."id" DESC LIMIT 1  [["vendor_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]