app/views/users/show.html.erb

    <h4 class="centered-text"><%= current_user.email %></h4>
    <% current_user.vendors.each do |vendor| %>
---
SELECT "vendors".* FROM "vendors" INNER JOIN "user_roles" ON "vendors"."id" = "user_roles"."vendor_id" WHERE "user_roles"."user_id" = $1  [["user_id", 5]]