app/views/orders/show.html.erb

SELECT "photos".* FROM "photos" INNER JOIN "order_photos" ON "photos"."id" = "order_photos"."photo_id" WHERE "order_photos"."order_id" = $1  [["order_id", 1]]
---
    <tr>
      <% @order.photos.each do |photo| %>