app/controllers/vendor_admin/vendors_controller.rb

SELECT  "vendors".* FROM "vendors" INNER JOIN "user_roles" ON "vendors"."id" = "user_roles"."vendor_id" WHERE "user_roles"."user_id" = $1 AND "vendors"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @vendor = current_user.vendors.find(params[:id])
    @categories = Category.all

SELECT  "vendors".* FROM "vendors" INNER JOIN "user_roles" ON "vendors"."id" = "user_roles"."vendor_id" WHERE "user_roles"."user_id" = $1 AND "vendors"."id" = $2 LIMIT 1  [["user_id", 2], ["id", 1]]
UPDATE "vendors" SET "about" = $1, "updated_at" = $2 WHERE "vendors"."id" = $3  [["about", "Small about."], ["updated_at", "2016-05-14 22:49:45.830546"], ["id", 1]]
---
  def update
    @vendor = current_user.vendors.find(params[:id])
    if @vendor.update(vendor_params)