app/views/vendors/show.html.erb

  <div class="medium-8 columns">
    <%= link_to image_tag(@vendor.photos.last.image.url), photo_path(@vendor.featured.image.url) %>
---
SELECT  "photos".* FROM "photos" WHERE "photos"."vendor_id" = $1  ORDER BY "photos"."id" DESC LIMIT 1  [["vendor_id", 1]]

<div class="row small-up-1 medium-up-1 large-up-2">
  <% @vendor.photos.each do |photo| %>
---
SELECT "photos".* FROM "photos" WHERE "photos"."vendor_id" = $1  [["vendor_id", 1]]