app/views/vendor_admin/vendors/show.html.erb

      <%= f.number_field :price, in: 1000..10000, step: "any" %>
      <%= f.collection_select :category_ids, Category.all, :id, :name, include_blank: false %>
---
SELECT "categories".* FROM "categories"