app/controllers/carts_controller.rb

  def create
    find_referrer
    photo = Photo.find(params[:photo_id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy
    photo = Photo.find(params[:photo])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", nil]]