app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."slug" = $1 LIMIT 1  [["slug", "buildings"]]
---
  def show
    @category = Category.find_by(slug: params[:name])