app/controllers/destinations_controller.rb

  def show
    @destination = Destination.find_by(planet: params[:planet])
---
SELECT  "destinations".* FROM "destinations" WHERE "destinations"."planet" = $1 LIMIT 1  [["planet", "Jupiter"]]