app/controllers/downloads_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 24]]
---
  def show
    photo = Photo.find(params[:photo])