app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 1]]
---
  def index
    @orders = current_user.orders

SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT 1  [["user_id", 6], ["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 5]]
---
  def show
    if current_user == Order.find(params[:id]).user || current_user.admin?

INSERT INTO "orders" ("user_id", "total_cost", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 20], ["total_cost", "3000.0"], ["status", 1], ["created_at", "2016-05-09 19:51:55.677743"], ["updated_at", "2016-05-09 19:51:55.677743"]]
---
  def create
    order = Order.create(user_id: current_user.id, total_cost: @trip.total_price, status: 1)