app/controllers/pending_controller.rb

  def index
    @vendors = Vendor.where(status: "pending")
---
SELECT "vendors".* FROM "vendors" WHERE "vendors"."status" = $1  [["status", 0]]