app/controllers/photos_controller.rb

  def index
    @photos = Photo.all
    @categories = Category.all
---
SELECT "photos".* FROM "photos"
SELECT "categories".* FROM "categories"

  def create
    @photo = Photo.new(photo_params)

    if @photo.save
---
INSERT INTO "photos" ("title", "description", "price", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "vendor_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def show
    @photo = Photo.find(params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 2]]