app/controllers/sessions_controller.rb

  def create
    @user = User.find_by(username: params[:session][:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "sespinos"]]