app/controllers/trip_packages_controller.rb

SELECT  "packages".* FROM "packages" WHERE "packages"."id" = $1 LIMIT 1  [["id", 4]]
---
  def create
    package = Package.find(params[:package_id])

SELECT  "packages".* FROM "packages" WHERE "packages"."id" = $1 LIMIT 1  [["id", 17]]
---
  def destroy
    package = Package.find(params[:id])