app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "user_roles" ("user_id", "role_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 4], ["role_id", 3]]
---
  def create
    @user = User.create(params_check)
    if @user.save
      role =  Role.new_customer
      @user.roles << role

UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "JonB"], ["password_digest", "$2a$04$Dpnx5rWVV7MxV.GA6WCdXeJ4ppG1F3v9kAv3u71yfpkly3ehjvM7e"], ["updated_at", "2016-05-09 19:51:53.406908"], ["id", 5]]
---
  def update
    if current_user.update_attributes(params_check)