app/controllers/vendors_controller.rb

  def show
    @vendor = Vendor.find_by(slug: params[:vendor])
---
SELECT  "vendors".* FROM "vendors" WHERE "vendors"."slug" = $1 LIMIT 1  [["slug", "fadel-konopelski-and-toy"]]